"""Задайте последовательность чисел. Напишите программу, 
которая выведет список неповторяющихся элементов исходной последовательности."""

list_number = [3, 65, 73, 65, 4, 4]
print(list(set(list_number)))