"""Упражнение 2. Приветствие

(9 строк)

Напишите программу, запрашивающую у пользователя его имя. 
В ответ на ввод на экране должно появиться приветствие с обращением 
по имени, введенному с клавиатуры ранее."""

print("Привет, {}".format(input("Введите ваше имя: ")))