"""Конструктор - это метод, вызываемый интерпретатором 
автоматически при инициализации класса. 
В Python этот метод называется 
_init_(): 
def init (self[, <Значение!>[, ... , <ЗначениеN>]]: 
<Инструкции> 
Конструктор используется для инициализации атрибутов класса. 
Также конструкторы могут выполнять некоторую подготовительную работу, 
например, открывать файлы, устанавливать соединения 
- все зависит от специфики вашей программы.

Аналогично, перед уничтожением объекта вызывается деструктор, 
который в Python называется _dеl_(). Учитывая, что интерпретатор сам заботится об освобождении занимаемых объектом ресурсов, 
особого смысла в деструкторе нет."""